# Importing Libraries

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
from sqlalchemy.types import *
import pymysql
pymysql.install_as_MySQLdb()

# Loading the tables into Pandas

In [2]:
basics = pd.read_csv('Data/title_basics.csv.gz')
ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
tmdb2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')
# Concatenating tmdb into one table
tmdb = pd.concat([tmdb2000, tmdb2001])

In [3]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [4]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1974
1  tt0000002            5.8       264
2  tt0000005            6.2      2617
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [5]:
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2222.0,PG

In [6]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2575 entries, 0 to 1335
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2575 non-null   object
 1   adult                  2573 non-null   float64
 2   backdrop_path          1407 non-null   object
 3   belongs_to_collection  208 non-null    object
 4   budget                 2573 non-null   float64
 5   genres                 2573 non-null   object
 6   homepage               172 non-null    object
 7   id                     2573 non-null   float64
 8   original_language      2573 non-null   object
 9   original_title         2573 non-null   object
 10  overview               2524 non-null   object
 11  popularity             2573 non-null   float64
 12  poster_path            2316 non-null   object
 13  production_companies   2573 non-null   object
 14  production_countries   2573 non-null   object
 15  release_date           2549 non-null   object
 16  revenue                2573 non-null   float64
 17  runtime                2573 non-null   float64
 18  spoken_languages       2573 non-null   object
 19  status                 2573 non-null   object
 20  tagline                1107 non-null   object
 21  title                  2573 non-null   object
 22  video                  2573 non-null   float64
 23  vote_average           2573 non-null   float64
 24  vote_count             2573 non-null   float64
 25  certification          816 non-null    object
dtypes: float64(9), object(17)
memory usage: 543.2+ KB

I see some Id's with a 0. I might need to drop those

In [7]:
tmdb.loc[tmdb['imdb_id'] == '0']

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Two values. might be from the top of each csv. Lets drop them

In [8]:
tmdb = tmdb.loc[tmdb['imdb_id'] != "0"]
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2222.0,PG
5,tt0118852,0.0,/vceiGZ3uavAEHlTA7v0GjQsGVKe.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.800,50.0,R

# Normalizing Genre
I want to take Genre and break out the unique values in the table. Then I want to create 2 separate tables to join it all together

## Creating a list of all genres

In [9]:
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
86737,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
86738,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86739,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
86740,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86741,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

## Exploding the column

In [10]:
exploded = basics.explode('genres_split')
exploded

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
86740,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
86740,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
86740,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
86741,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
86741,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

This gives us multiple records for each id. I want to save the unique values of genres_split into a list in order to create a new table with them later on

In [11]:
# Saving to a list
unique_genres = sorted(exploded['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## Creating the new tables
I am going to take the exploded table and only save the ID and the genre, this will be our first intermediary table in the normalization process.

In [12]:
title_genres = exploded[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In order to create the genre table, we need to map the individual genres to an ID, then match that ID to title_genres. Lets do that now

In [13]:
genre_ids = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ids))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

Now that we have this dictionary, we can create a dataframe from it. We can also remove the genre strings from title_genres and replace them with the integer ids

In [14]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.drop(columns = 'genres_split', inplace = True)
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [15]:
# Making the genre map table
genre_lookup = pd.DataFrame({'id': genre_map.values(),
                            'genre_name': genre_map.keys()})
genre_lookup.head()

   id genre_name
0   0     Action
1   1      Adult
2   2  Adventure
3   3  Animation
4   4  Biography

Our 2 genre tables are all set to be loaded

# Dropping columns from Basics

In [16]:
basics.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'endYear', 'genres', 'genres_split'],
            inplace = True)
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

# Dropping columns from TMDB
We only need MovieID, Revenue, Budget, and Certification from this table. We can drop the rest

In [17]:
tmdb = tmdb.loc[:,['imdb_id', 'budget', 'revenue', 'certification']]
tmdb

        imdb_id      budget     revenue certification
1     tt0113026  10000000.0         0.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694    150000.0  14204632.0            PG
5     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
1331  tt7797790         0.0         0.0           NaN
1332  tt8665056         0.0         0.0           NaN
1333  tt8795764         0.0         0.0            NR
1334  tt9071078         0.0         0.0           NaN
1335  tt9212730         0.0         0.0           NaN

[2573 rows x 4 columns]

# Loading to MySQL
Now I will use sqlalchemy to load the tables into a MySQL database. I will create the following tables:

* title_basics
* title_ratings
* title_genres
* genres
* tmdb_data

In [18]:
conn_string = 'mysql+pymysql://root:root@localhost/movies'
engine = create_engine(conn_string)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [19]:
if database_exists(conn_string) == False:
    create_database(conn_string)
else:
    print('DB Already Exists')

DB Already Exists

## Basics
Since we have a string primary key, we need to define each column before loading to SQL. Lets begin that process here

In [20]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86742 entries, 0 to 86741
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86742 non-null  object
 1   primaryTitle    86742 non-null  object
 2   startYear       86742 non-null  int64
 3   runtimeMinutes  86742 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.6+ MB

In [21]:
# Gathering the length for tconst and for primaryTitle
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

# Creating the schema dictionary for basics
basics_schema = {"tconst": String(key_len+1),
                "primaryTitle": Text(title_len+1),
                "startYear": Float(),
                "runtimeMinutes": Integer()}

In [22]:
# Loading to SQL
basics.to_sql('title_basics', engine, dtype = basics_schema, if_exists = 'replace',
             index = False)

86742

In [23]:
# Setting the Primary Key manually
engine.execute("ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);")

### First 5 rows

In [24]:
q = """select * from title_basics limit 5"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

## Ratings
Same process for this table. Lets get the columns and create a dictionary for the datatypes

In [25]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499622 entries, 0 to 499621
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         499622 non-null  object
 1   averageRating  499622 non-null  float64
 2   numVotes       499622 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.4+ MB

In [26]:
# A bit redundant, but this will make this code reproducible and consistent
key_len = ratings['tconst'].fillna('').map(len).max()
# Schema Dict
ratings_schema = {"tconst": String(key_len+1),
                 "averageRating": Float(),
                 "numVotes": Integer()}

In [27]:
# Loading to SQL
ratings.to_sql('title_ratings', engine, dtype = ratings_schema, if_exists = 'replace',
              index = False)

499622

In [28]:
engine.execute("ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);")

### First 5 rows

In [29]:
q = """select * from title_ratings limit 5"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1974
1  tt0000002            5.8       264
2  tt0000005            6.2      2617
3  tt0000006            5.1       182
4  tt0000007            5.4       820

## Title_Genres
Title Genres is a joiner table, an intermediary between two tables that have a many to many relationship. We do not need to appoint a primary key to this table.

In [30]:
title_genres.to_sql('title_genres', engine, if_exists = 'replace', index = False)

162029

### First 5 rows

In [31]:
q = """select * from title_genres limit 5"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

##  Genres
This table does have an ID, but it is an integer ID. We will assign the primary key a little differently here

In [32]:
genre_lookup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          26 non-null     int64
 1   genre_name  26 non-null     object
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [33]:
genre_lookup.set_index('id').to_sql('genres', engine, if_exists = 'replace', index = True)

26

### First 5 rows

In [34]:
q = '''select * from genres limit 5'''
pd.read_sql(q, engine)

   id genre_name
0   0     Action
1   1      Adult
2   2  Adventure
3   3  Animation
4   4  Biography

## TMDB Data

In [35]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2573 entries, 1 to 1335
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2573 non-null   object
 1   budget         2573 non-null   float64
 2   revenue        2573 non-null   float64
 3   certification  816 non-null    object
dtypes: float64(2), object(2)
memory usage: 100.5+ KB

In [36]:
# Getting the length of each string column
key_len = tmdb['imdb_id'].fillna('').map(len).max()
cert_len = tmdb['certification'].fillna('').map(len).max()
# schema dict
tmdb_schema = {"imdb_id": String(key_len+1),
              "budget": Float(),
              "revenue": Float(),
              "certification": Text(cert_len+1)}

In [37]:
tmdb.to_sql('tmdb_data', engine, dtype = tmdb_schema, if_exists = 'replace', 
            index = False)

2573

In [38]:
engine.execute("ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`)")

### First 5 rows

In [39]:
q = """select * from tmdb_data limit 5"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

# Show Tables

In [40]:
q = """SHOW TABLES"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data